{
  "ads": [
    {
      "id": 210457008,
      "name": "Manager, Information Security",
      "url": "https://click.appcast.io/track/f373z3n?cs=i4q&jg=5rkr&bid=ZTAIU9X3zQHjJYLb9Yqb8A==&utm_campaign=joraAU&utm_medium=cpc&utm_source=joraAU",
      "campaign_id": 852473,
      "advertiser_id": 104422,
      "category_ids": [6281],
      "subcategory_ids": [6297],
      "request_id": "ebo75kswooaeqycm",
      "metadata": {
        "id": "b7dbd22d73ee1336be50c3c8d09600dd",
        "title": "Manager, Information Security",
        "normalised_titles": "Manager",
        "abstract": "Reporting to the Head of Information Security you will support strategic business decisions where information security, compliance, and privacy are of the utmost concern. You will be responsible for developing a security conscious culture and to ensure that the business operates in line with an appropriate risk management profile.",
        "text_description": "When we started back in 2000, we had one route, two aircraft and a dedicated team of just 200 people. Today, we have over 70 aircraft flying to more than 30 destinations across Australia and team of 6000 (and counting).\nWith travel well and truly back, we are united by our ambition to be the most loved airline in Australia, and always go one step further for our customers, colleagues and our wider community.\nJoin the team to today and be part of something big.\nJob Overview\nWork type:\nFull Time\nLocation:\nSydney\nJob type:\nIT\nManager, Information Security\nWe’re the airline that’s always done things a little different. Our way. The Virgin way. For us, flying is so much more than simply taking off and landing (although we understand that is quite important). It’s about going the extra mile, in the air and on the ground, to create authentic experiences that put our guests firmly at the heart of everything we do.\nWhat you’ll be doing:\nReporting to the Head of Information Security you will support strategic business decisions where information security, compliance, and privacy are of the utmost concern. You will be responsible for developing a security conscious culture and to ensure that the business operates in line with an appropriate risk management profile.\nOther responsibilities include:\nYou will provide guidance to the VA and Velocity Frequent Flyer leadership teams by recommending information security controls which will mitigate risks to our digital assets, playing a key role in helping the business’s achieve its strategic objectives.\nYou will bring a sophisticated, risk-based, approach and have solid working knowledge of the information security best practice and its application across real-world corporations.\nYou will solve complex problems and can balance getting innovative business solutions to market whilst managing risk.\nYour ability to manage stakeholders, communication clearly, and capability to influencing across many levels of business stakeholders will set you apart.\nYou will be passionate about technological trends/ developments in the areas of information security, risk management, web architectures, and cloud.\nWho we’re looking for:\nYou will have 7+ years in Information Security Roles.\nYou will have strong knowledge of key information security standards and experience in implementing information security programs, policies and procedures in enterprise environments.\nYou will have strong interpersonal and people skills with experience of managing and influencing internal and external stakeholder groups.\nYou will be able to confidently address senior executives when required and provide simplified overviews of key information.\nStrong strategic understanding of how information security affects broader business goals.\nWhat you’ll get from us:\nWe’re committed to looking after you, with some of the best benefits and conditions in the industry – including (but not limited to):\nHeavily discounted air travel for you and your loved ones (including $1000 worth of travel credits per year)\nFlexible working arrangements (including work hours and work from home)\nDiscounts on travel insurance, car hire, accommodation and experiences worldwide\nHospitality, retail, technology, beauty services and wellness discounts\nWellness support, including the betterme digital wellbeing platform\nA comprehensive Employee Assistance Program, which offers confidential coaching and support from qualified professionals for all aspects of life – physical, mental, social and financial\nDress for Your Day – enjoy the freedom to wear whatever is appropriate for the type of work you do and the day you have ahead of you\nEquality rules\nWe’re all individuals. We love that. That’s why we encourage applications from Indigenous Australians, people with disability, those from diverse cultural backgrounds, our friends in the LGBTQI+ community, and anyone else who wants to join our family.\nCOVID-19\nThe safety and security of our people, guests and operations come first. Always. That’s why we’ve put together a comprehensive ‘Mandatory COVID-19 Vaccination Policy’. In a nutshell, to work with us, you’ll need to comply with our (and the airport’s) rules and regulations. And be fully vaxxed.\nReady to apply?\nWe’re ready to hear from you. Apply now.",
        "source": "Virgin Australia Airlines",
        "site_name": "Jobleads AU",
        "listed_date": null,
        "job_hash": "594273334116919267",
        "raw_location": "Sydney NSW",
        "direct_posting": "false"
      },
      "click_tracking_url": "https://events.jora.com/v1/c?d=gc9t09x7f36tdh4d49sv56l9mmZ04rchpmycj0lx5A8mcw1vkfqvpbkc4y2fhxlx85kbhn4smzbrx19h4fhbvwft6xjAy3pq3446d4vxd69xAwl00d5g4m2k94gm3wy8A97n3wqmky5vd55pp1tcblz0qt855A94877y5qnqntwm0lhx2pzmhcA3w6pb5pf7q5cz87xfk0h23rylh199gbvhhczvyrn0rhq53kdljpm5h3dvb7p50n5shfjdw71xn81jzdb6qy3hw1478qj7dd1A08pyr710h6Az3p95fn8tsfmcndy376btrkl1sndkpdf4twmy8mfdcpwx1qhzhxmvjt1ttAr38zpkj7p0tnfchhjv4qcc21ptwAx3b7wqhtmdlhjAbcm55nxl74Ad11n5ym61r4h3qqt0fndf19tnh6jzvd2A4sbnlcjs6tqqtw0ks8gqrnkncv2g61p9391vc7hqv7y96jy7nnfthA2sfh8n9q425mqhm6656zbf5y&rd=639805&tk=c0d63fbae36d5746",
      "impression_tracking_url": "https://events.jora.com/v1/i.gif?d=h6dbnp63m35pdpAws9thk5cwyqZ533q5chgt9nfAvgAhzfAhkjwyk5t33lnp9A5l43my360z2tp32btf17npgc9qkcxxhykkm9bAhqhp2j8qmbkjz5jy58bfA92Agq418b2Ar2rzknvmgx2dmxg0qprnb3n7j5bjwvs963dkq4p3dqApmqh52ttv6yqylwsptpg2jvp510343zw7sl4Asc4lrnt7y0zvhffsrtpmhyAm06wv35hq0db5ymskdkn69bsAjAg8qhdf90gtg5rgpvtrAl41p351hlnk19qw7z15rpfxAmzbgxljpj1wlwjqjj2Awq4m3bq1xs0j69kgrbv161h166jb36sll8qdgAkg0kprl1pwdk9h24bxp80k2z2zg29mv4rxwjrkm4chnsp745y4ntxdyfxj6jzbtbc7r38bv7rdA975j79A7qjy4kmcdd9hyg99flcwwgjj73m5sjvsyq9AdA0mx4khfzt6zq895zhqAxyq3mwmAttv81&rd=640861&tk=f7086306184b1035"
    },
    {
      "id": 209212624,
      "name": "Cyber Security Business Analyst",
      "url": "https://click.appcast.io/track/ez8fgz2?cs=lgq&jg=50oe&bid=RjisTn_QvJ_s6s7uxZBkFw==&utm_campaign=joraAU&utm_medium=cpc&utm_source=joraAU",
      "campaign_id": 852494,
      "advertiser_id": 131052,
      "category_ids": [6281],
      "subcategory_ids": [6283],
      "request_id": "ebo75kswooaeqycm",
      "metadata": {
        "id": "96cac53e626b0727bd2bb775e8e4ef9c",
        "title": "Cyber Security Business Analyst",
        "normalised_titles": "Cyber Security Business Analyst",
        "abstract": "A leading Financial Services company based in Melbourne is looking for multiple Senior Business Analysts to work on their enterprise-wide Cyber Security Program.",
        "text_description": "A leading Financial Services company based in Melbourne is looking for multiple Senior Business Analysts to work on their enterprise-wide Cyber Security Program.\nYour new role\nYou will be responsible for a broad range of tasks and duties including:\nElicit and document Information Security goals, success factors and Business, Functional and Non-Functional requirements\nManage the interaction between business and technology teams to ensure effective support for system delivery/upgrade is achieved\nAct as the business requirements owner for agreed projects, representing the requirement intent and ensuring that relevant project deliverables trace to and align with the business requirements\nWork closely with operational teams and vendor resources as required on BA activities\nBuild working relationships within the cyber security program and across key teams to ensure successful delivery of outcomes. Working collaboratively with a diverse set of stakeholders across all levels of the organisation\nWhat you'll need to succeed\nTo be considered for this role you will possess the following:\nStrong BA skill set with exposure to large enterprise-wide programs.\nExperience in key cyber technologies such Data Loss Prevention, Cloud Security and Security Incident and Event Management.\nIdeally have exposure to projects implementing SIEM, IDAM, infrastructure monitoring and uplifting other cyber security operations capabilities.\nExperience working in an Agile environment.\nExperience in project management tools JIRA \u0026 Confluence highly regarded.\nExcellent written and verbal communication skills. Familiarity with enterprise process modelling tools.\nWhat you'll get in return\nAn attractive day rate, multiple contract extensions and the opportunity to work on a large program of work.\nWhat you need to do now\nIf you're interested in this role, click 'apply now' to forward an up-to-date copy of your CV to prachi.kalyanarora@hays.com.au, or call us now.\nIf this job isn't quite right for you but you are looking for a new position, please contact us for a confidential discussion on your career.\nLHS 297508 #2693718",
        "source": "Hays",
        "site_name": "E-Financial Careers Australia",
        "listed_date": null,
        "job_hash": "651328075201373152",
        "raw_location": "Melbourne VIC",
        "direct_posting": "false"
      },
      "click_tracking_url": "https://events.jora.com/v1/c?d=czxp36f11z7c70t193mmxd8t3mZkhtm3dkpt9xllpyg5bws35j2ls8svv4t7vgxpjjq36gh38f5dgp9srhn0fdl5n04qy9pnhjx63sfl2dknrq42t5n5smg7c06pyyj31qf09yA39v78q7rrx7qgtx22mk5v6wc0gc8hfpf64cjy8pdt5ry6c91bvm7b4bgAbbbdsggbv65qrm3rpphpg0d1lzj98wtx3slpfxAtlw0qjgcfq1r9wpkk1m8vgfwymkxxnm0xz9qdl9nykmcxt1vvmx9k7bq2ywsfbbwh1fsgnf87mjb0ncpgx2jp2lrrk9qbygyzdc33gxxn0563nybqztyfgjhlgngbzfz95hk98Ax0m2n6d8414mdy8h1csvAw4q6bvt7k9tbdtymt7hAtt34z7r6y5bb114A115wrz9rr48knj7mrnhyjA3cchvf3gA0g6mv3Acz5mh4z6f2b2d9lvgmn3wmqkhy4n6zgd45v6mskv8Abxtd2czp2t3&rd=641974&tk=aae435af83964232",
      "impression_tracking_url": "https://events.jora.com/v1/i.gif?d=1x8y54hrA17ldcsnwmcwgbzfy1Z0ppqs7449A228rp88k9qmgystlwxnxpA58vc2c9lrjm3qnydjx9dnb1j4qs8gsj99z97q4p44lfy5bn4j591A358bfmhz3txqAjAywg56tcjAt1g0fr4dhhvb6y3mq4bAtrrsA854rbmAyz7pvtpfkg3vqx6zpc4bwrkcv67x87c21chdqtjxAvwtb2p5j9hjjqzbbxc3sw605wgpb9hpk6lf461r650ntwqk2q5yd7911r1nn5j6kcbd605skmkpkg86zbjp1tyjbpryx1yqfqswp5Aw3b7zfwzvn90vs3kkyk9bAvw9qjx33fmbllltdgxf9r0w5z89vmw6ktwg32c3m8hsnj0z7AyAl969m9mt4z7lyA56lswqssqvbbtr78t6dkt9xgbAh2n1vfpslx4x04s54q9zt3dc9mkh14ncqfvAAnwwtfrbv70t4bw4pvbr9dt4nj5ys9vzrkth0bsft5j899gjrr2dy1&rd=643136&tk=73db5964f0e29e53"
    },
    {
      "id": 208685828,
      "name": "ICT Security Specialist",
      "url": "https://au.jora.com/job/ICT-Security-Specialist-c5ebeacbea76496749b756b1ab83e12f?utm_campaign=joraAU&utm_medium=cpc&utm_source=joraAU",
      "campaign_id": 852229,
      "advertiser_id": 12318,
      "category_ids": [6281],
      "subcategory_ids": [6297],
      "request_id": "ebo75kswooaeqycm",
      "metadata": {
        "id": "c5ebeacbea76496749b756b1ab83e12f",
        "title": "ICT Security Specialist",
        "normalised_titles": "ICT Security Specialist",
        "abstract": "We are seeking a highly skilled ICT Security Specialist to organize and oversee all digital security operations of our company\nJoining as part of the Kamala's IT team, you will: -",
        "text_description": "Kamala Tech Pty Ltd is a technical and administrative services company supporting custom e-commerce/e-gaming environments used under license by B2B operators and resellers in the Asia region. We add value in the accounting, legal and IT technical field through providing cost analysis, BI reporting services, project management, sourcing legal and tax opinions, training, and support.\nWe are seeking a highly skilled ICT Security Specialist to organize and oversee all digital security operations of our company\nJoining as part of the Kamala's IT team, you will: -\nWork closely with all stakeholders to ensure that appropriate security guidance is provided to support project delivery\nFulfill the essential willingness to travel extensively within the Asia Pacific region to meet such stakeholders, most of whom speak Mandarin, therefore fluent Mandarin speaking is a necessity\nPerform security risk analyses for Kamala Tech and its customers, and recommend appropriate solutions to address these risks\nDesign, Plan and Implement recommended solutions to address identified security risks\nProvide input into the design and implementation of standards, policies, guidelines and appropriate architectural principles to ensure cyber security goals continue to be met\nProvide risk-based direction in conjunction with IT Services for future system enhancements in line with the overall strategy\nRecognise potential opportunities for enhancing security, ensuring minimal impact to practitioners\nAssist our customers to manage their relationships with third party contractors / suppliers / vendors including diagnosis of complex security issues relating to software and hardware platforms\nTake ownership and ensure Governance, Policy and Procedures in relation to Management of Information Security\nWe encourage you to apply if you have: -\nTertiary level or above qualification in Digital / Network / Information Security / Computer Forensics / ISACA Certified Information Manager or equivalent industry experience\nExcellent knowledge of current digital security standard, proven proficiency in developing digital security protocols and procedures\nUnderstanding of information security principles and best practice such as ISO27001 and ISF Standards of Good Practice for Information Security\nStrong understanding and experience with implementation of Cyber Security controls within a Cloud and Data Centre context\nAt least 10 years of practical experience and broad knowledge of a wide range of Information Technology systems and a deep understanding of the inherent security risks\nExtensive knowledge of penetration testing systems and recovery systems\nMinimum 4 years actual experience working with AWS Cloud Security\nMinimum 2 years experience working with blockchain and crypto-currency technologies, including ETH, BTC, NFT\nExcellent interpersonal skills with the ability to build and influence teams\n** Please note that Kamala Tech would like to take this opportunity to thank all applicants for their interest. Only those considered for an interview will be contacted directly.",
        "source": "Kamala Tech Pty Ltd",
        "site_name": "Jora",
        "listed_date": null,
        "job_hash": "11294186137379459",
        "raw_location": "Perth WA",
        "direct_posting": "true"
      },
      "click_tracking_url": "https://events.jora.com/v1/c?d=ybcAt0bsw0hpqt7vx7g8bj6w31Zg3cln7j8vyw5tr4t63zr2m24t4wznpl0sb547j1Apg5ysngm716v3dbf3txbwp14lfznm4nk6g97l1mlc08kpjgjlws06v5twj32pgzAp8czfzl164k0pdAxnjccxz0vm4bshf2qfkr9tgbt8h9m1by8l0d17pzmtqjxcq18msx2k9Abz90hfyjg3msplbj52Abr6v81375yggm0gnn5rv35vp9kx10xr80ytt9nyxzh66v8Ah5svgpm6dtqn4yjk6b6gbbccyws0zhhmq2d3ttAszszvpx89h6d2sAh1vcrd8zlvxjbqtAd50bwqxk0sAy00sA7l7rnzkx44kbb88qfjk4yy6jn2wqtnpr300vryn8t3xzk2jqk4yxtAgvll71dk4z19b9zf73mx4m0q9843xlxjt7lm4hryv62m567whppy9x5ymlbzlzqvq44Ay50Ayv97w647&rd=660316&tk=b81d0aacf3b71302",
      "impression_tracking_url": "https://events.jora.com/v1/i.gif?d=dnmk393ckylh3yt3c0jzptd7g7Zjtxnvfr8dp5904mhk170p2tb3xbgdwl4nyldm46yzz9Ar9xd3b1tArvgt5mh4qAv41gr773ly03hs3f2vf6mAmc6fgkwwvr0xj80gc2AqsnsAfts0hdvkt51hk8A7fqAvl9rh541v65wcvAbb3qp6gAcfp9cz32fzp8z9708f635c77rm039kjrA22fzb1pynz0sljxgg07pAA0tbs1g8g4x8r6glwy24k8zf30hkd9st5v1jn3h231gzh7h2zrtgs99cj3tqxvAdjmc3vt2jsjs9gpA7vn68gtpxAzdrtmltfmbctApj390pkn1w52msb2bA9qn0njq6pd63jdjdAwcAncjyppkd9hs3zcy60523mkn8yvjfn24r7mk4k337sjtm33h74ll1rnlsrtmd2f8z287j7rmnhspl2pfm0f38xx6dr73sqkw6s3gmbmmrv4Awnj0c2mlm&rd=661636&tk=a00e938efcbefc0c"
    },
    {
      "id": 210185449,
      "name": "ICT Security Specialist",
      "url": "https://au.jora.com/job/ICT-Security-Specialist-f216fd05bc18352910496537de838001?utm_campaign=joraAU&utm_medium=cpc&utm_source=joraAU",
      "campaign_id": 852229,
      "advertiser_id": 12318,
      "category_ids": [6281],
      "subcategory_ids": [6297],
      "request_id": "ebo75kswooaeqycm",
      "metadata": {
        "id": "f216fd05bc18352910496537de838001",
        "title": "ICT Security Specialist",
        "normalised_titles": "ICT Security Specialist",
        "abstract": "Implement security policies as outlined by the corporate security policies and government policies.\nBuilding SOD policies and implementing identity life cycle management requirements.",
        "text_description": "Manvision Consulting provides IT Contracting and Professional Services to the Australian Market since 2008. Join a talented team and work in a culture that stimulates an inclusive and flexible work environment, offering opportunities to grow and contribute to the company.\nRoles and responsibilities:\nSetup Identity Access Management by integrating the access to the root directory for users.\nSetup Network intrusion detection system, logging system and intrusion prevention system.\nImplement security policies as outlined by the corporate security policies and government policies.\nBuilding SOD policies and implementing identity life cycle management requirements.\nConduct regular audits of the assets being used, logs of usage, incidents tracking \u0026 management and database, application access, and rest of the IT infrastructure.\nPerform vulnerability tests of the firewalls.\nConduct risk assessment for client infrastructure security requirements.\nImplementing and testing security protocols for ongoing projects.\nDesign and implementation of disaster recovery plans from a security perspective.\nFirewall planning, installation, and management of the client data centres.\nDeliver on HLD and LLD of the Network Security Solution for data centres.\nPlan, investigate, set up, and test implementation of VPN, WAN, LAN, and other related devices.\nDesign certification authorities and digital signatures.\nHelp clients in due diligence for WAN Rationalization and DC Transformation\nKey Requirements:\nApplicants must have a minimum of 5 years of work experience in IT security. Must have experience in working, investigating, setup, and testing the implementation of VPN, WAN, LAN, and other related devices. Strong knowledge of Network and Systems Security. Proficient with MAC and OS.\nAbility to communicate clearly verbally and written with cross-functional teams and external stakeholders\nExtensive experience within the application and web security\nExpertise with security tools – static code analysis and vulnerability scanning\nProvide direction and consultation to development teams, providing security services and influencing change to positively impact the security posture of the organization.\nWork autonomously within Security; uplifting secure coding practice, through training and education programs delivered to colleagues working in the delivery of change.\nBuild networks and strong working relationships with colleagues, and been seen as a trusted provider of application security services and advice.",
        "source": "Wealthzone Technologies",
        "site_name": "Jora",
        "listed_date": null,
        "job_hash": "156889799325552378",
        "raw_location": "Blacktown NSW",
        "direct_posting": "true"
      },
      "click_tracking_url": "https://events.jora.com/v1/c?d=fh9nql810ht3lb88td19f58b77Z7h8032bAfcgk7djt4vyjgcf0mhfh9And3byzm7jz5zv77q953jntccxcvj6hAzr4h4lmn1vh0j5cgjkcg79zvzvtt65cjx59562v627g7pkj24yA8vg2jAm3z475gs7xh8lsb5gkd540bdlyyft5prp14184qx42l04rg874t4dr75pk5rk07tzsy1myndwvbmt2jgycpn25b0jbw7023A4tpyrzkjmA5vc2xxrhq5brj26v336Arxjfv20pqn4c4lhrz6c679l3nv0bqgql5sq6A4hvyd14wcpfc3kqggfr66ctcw4shvvx9h5018ns6h6zygb21dkzz8rxyddxA64k5782lm98pc60wkw6093Avqhc6kvzqpw2f6lgrjhx1zg9ynrdgxljq20qjtxxln5h2v9xv0cymb611bqkm5l0t48mlnbx021tsj1v5t60c14yr97l5Aqfq&rd=662759&tk=6b2d9c2298fb5727",
      "impression_tracking_url": "https://events.jora.com/v1/i.gif?d=nbj9A6wt6m2cg78jtjrjqx0bfqZqr6w3zcnszw83yvgg6yzlvb6vmsd8sg0f6gsAwgAnb5w2f1sp50r0dq42rqx4nmlqwpvr3xr3y3s52t6633z18xA94yk1hnbn5kgdv3A89bg7c5hw77071j0sm6A7At5r2yA7s34779ks3438qy96jl05k42w7Acbl53kqsjgz41t29yrht9rxcfcwmwt29j5t3A8wqy2873bx0qrlf8gdkmjscr1dx31l3mbfjxmd7k3qtrd85gAmj5Akw32qwj2xqxkb339cftw1lt5Anzykq4t2zts7qqzxnn5gd5j0nAt83ztjAybAs87s3xv63s9fzml5lbftrwkAtskm2f03d8qhz4psdlwnh4s1t31tgmk2ttjsysAb32cwt5qjj9vw6yxyp1b2Az3j1ltkc2rn1hcjrncc3s0ssArsA65h1nlyyyzAf0d3mqn9v80chzntbnssfwg27mk&rd=663813&tk=608a7b34022c10ba"
    },
    {
      "id": 209380444,
      "name": "ANZ Director Of Cyber Security Services",
      "url": "https://au.jora.com/job/ANZ-Director-2198fb19ab000fb058a50136f842898b?utm_campaign=joraAU&utm_medium=cpc&utm_source=joraAU",
      "campaign_id": 852473,
      "advertiser_id": 104422,
      "category_ids": [6281],
      "subcategory_ids": [6296],
      "request_id": "ebo75kswooaeqycm",
      "metadata": {
        "id": "2198fb19ab000fb058a50136f842898b",
        "title": "ANZ Director Of Cyber Security Services",
        "normalised_titles": "ANZ Director",
        "abstract": "We are currently working with an elite CyberSecurity organisation who are showing tremendous growth in the ANZ region. They are looking for a highly talented individual to head up their Australian and New Zealand operations and develop and lead a set of clients in the region as part of the client leadership team.",
        "text_description": "About NextWaveNextWave Partners is the Recruitment Partner of choice within the Clean Energy, Sustainable Infrastructure, ESG, Impact Investment, Climate-Tech \u0026 Technology sectors. We are committed to supporting industries battling climate change towards a net-zero future and a sustainable economy.\nAbout the Role\nWe are currently working with an elite CyberSecurity organisation who are showing tremendous growth in the ANZ region. They are looking for a highly talented individual to head up their Australian and New Zealand operations and develop and lead a set of clients in the region as part of the client leadership team.\nResponsibilities\nDevelop long-term professional relationships and serve as the trusted advisor of industry leading multinational organizations.\nIndependently lead a set of clients in the region as part of the client leadership team, reporting to VP of Cyber Security Services APAC\nGenerate new business opportunities and work with existing clients to drive additional engagements by attending events and client workshops, developing proposal and sales collateral, leading business development discussions and scoping engagements.\nRequirements\nProven business development track record in generating and managing opportunities in the ANZ region.\nA minimum of ten years of work experience with at least four years in strategic consulting and/or cyber security leadership role.\nHighly pro-active, independent, hands-on, resourceful and creative, with a robust ability to deliver under circumstances of pressure, uncertainty and complexity.\nApplicationIf you are interested in this position, please apply directly on the platform with your latest CV. We will review your application and revert back promptly.\nKeep in touchIf you would wish to keep up to date with the latest NextWave opportunities and industry updates, please follow us on LinkedIn and create your profile on our website to receive a weekly newsletter in your inbox!\nOur commitmentDiversity is a core value at NextWave Partners, and we are proud to be partnering with equal opportunities employers. All qualified applicants will receive consideration for employment without regard to race, colour, religion, gender, gender identity or expression, sexual orientation, national origin, disability or age.\nNextWave Partners Ltd. (EA License No: 16S8303 - UEN: 201602833E)Web: www.next-wavepartners.com",
        "source": "Nextwave Partners Pte. Ltd.",
        "site_name": "Jobleads AU",
        "direct_posting": "false",
        "listed_date": "2022-08-31T00:14:00Z",
        "job_hash": "13283477731192738",
        "raw_location": "Australia"
      },
      "click_tracking_url": "https://events.jora.com/v1/c?d=wfkvq8b07b26q11wsq2p6j2jkmZ240s81kj0w5xj6gg1cwswn9shb93yqd55b3Ahh7vApjnhjg94bwkq3szwzxkbpv5t61hx5njncwpztqfmkAcy775A0bv5sr0h2ncyryh59q9q0kq5xm8wmp4p0clt6A1nxhvh134z07vdkjp6jbv3jkjxbjqwy69hdngdsmcdp8v4g4v5mfz9tc87qh5f6wv112ml82xjrrt85qwcrdskkp4md0xm4l0t1780tm1w61h0A9dfAq8p168mmpvhl36wkshcshj1rq7df7hp8s64zwcrytp3ylxqvx4mhp22yt6fc0gzsc0A1kpxptfgvljhbxfmvkqvrkllhn5Ak4n5bnlA2f1pqz81jjmlxdbph2xk1yf992gA8l1rlz8tnfkhm8g9fd2mj930600yw0A97cgk2n3y1tm78yy7xcnyr47j45t3x2q&rd=664884&tk=6730c0ce9dfb4f09",
      "impression_tracking_url": "https://events.jora.com/v1/i.gif?d=9s899s004mj8ptvhvqyj1jsybqZq8strf83v7mm413tz26wlnr3145b1jzvz4j9rrzbA9964ft8d8lywdpyvs8wdjwql7c7c9ywcpj3rw2d2ng6g3cm4Atp34lAks45nvl2rz49nk9lr5ldgg2b0pmy719t9d73hjA1wpbhxttnjgf9929kl3sc0qbjjtrtc26k80lA7p3txc313430wjAh7t872gt5rsnry7ts2fjjxjlcAwl4hzzj0d8bmsArfpy86l6tq2dtkl6p86wkynktp2cvb3x60hkw9zh3yj86zkfjjxw337trt51d09c2nk2hgj19q99k2k7Abt8p9bqzrbfnn0b9f8st5tp8tlf3fmwr0l178j1hcv331120jj3n715xz7s1yt2kfsb6t2lnt5ssfjs2yjnq6vxfh5vczv9gb4jjvsfw65xg1qx6lbns0308kkb83twq&rd=665950&tk=60f30e3fb5373053"
    }
  ],
  "request_tracking_url": "https://events.jora.com/v1/r.gif?d=92mpAsgytzswzpbgsqsc0w64l7ZznhApq7c79gq1q9xjd5hpjl2xbgkzq4l7wc5zx08r1A8py5q0vsg4nArzbc4sp6Aw8s7q8A95m6qlvp2cszncqz7m6rhz0mbjth12xA9Axzj4jzAf1g115n0s4l1cxA2zbjq01fd0flf2nw1qmjsmznqfkAdztAqlldjbs280txlyzcdm0mf27tqqdhn5kwwct55qns7vxgAw&rd=666647&tk=67f591f619392c98"
}
