{
  "ads": [
    {
      "id": 210890163,
      "name": "Third Party Cyber Risk Analyst",
      "url": "https://click.appcast.io/track/f4uly0h?cs=lgq&jg=50oe&bid=RjisTn_QvJ_s6s7uxZBkFw==&utm_campaign=joraAU&utm_medium=cpc&utm_source=joraAU",
      "campaign_id": 852494,
      "advertiser_id": 131052,
      "category_ids": [6281],
      "subcategory_ids": [6297],
      "request_id": "igvni010yo3akkig",
      "metadata": {
        "id": "f82b8f8180dc2a4ee9d9458888e4dcd2",
        "title": "Third Party Cyber Risk Analyst",
        "normalised_titles": "Third Party Cyber Risk Analyst",
        "abstract": "In this role you will be responsible for providing operational support and executing cyber risk management activities throughout the third-party management lifecycle by facilitating the third party risk identification process and completing third party risk assurance activities.",
        "text_description": "This is an immediate requirement for an experience Third Party Cyber Risk Analyst on a 6 month contract.\nYour new company\nWith a large number of projects in 2022, an exciting contract opportunity for an experienced Third Party Cyber Risk Analyst has become available working remotely for a client based in regional NSW.\nYour new role\nIn this role you will be responsible for providing operational support and executing cyber risk management activities throughout the third-party management lifecycle by facilitating the third party risk identification process and completing third party risk assurance activities.\nYou will also be required to:\nCollaborate with internal stakeholders to ensure third party risks are properly identified\nProvide expert guidance and support on key controls, standard processes, operating procedures and best practice\nLiaise with cross functional teams to ensure third party engagements are compliant with policies and regulatory guidelines.\nWhat you'll need to succeed\nExtensive experience in operational and third party cyber risk assessments\nStrong analytical mindset\nAbility to identify issues and them through to closure\nStrong documentation and communication skills\nTertiary qualification or Industry Certification\nWhat you'll get in return\nOn offer is a 6 month contract and the ability to work remotely with an organisation that is currently undertaking a large Cyber Security Uplift Program. This role is offering a competitive day rate commensurate with experience.\nWhat you need to do now\nIf you're interested in this role, click 'apply now' to forward an up-to-date copy of your CV, or contact Jayde Avery on 0240328660 or via email jayde.avery@hays.com.au If this job isn't quite right for you but you are looking for a new position, please contact us for a confidential discussion on your career.\nLHS 297508 #2697489",
        "source": "Hays",
        "site_name": "E-Financial Careers Australia",
        "listed_date": null,
        "job_hash": "4036741930788640169",
        "raw_location": "Sydney NSW",
        "direct_posting": "false"
      },
      "click_tracking_url": "https://events.jora.com/v1/c?d=t101wqA29r6rtkm00rs9mlmjbqZftfxrrddqr2lpqcc64s4ctq7fAqcrlkw4682lrgnsq9yktzpbv5ccAyc2pwcxcyr1hvxsk5v4kgzA4drrpq85jwx9kjA5zns6w9d1czf5lkzwA0yxmq59qwxzn2xh83xpsbAtn15f67sq9yxwpm41A5w6s44ldftgd8yhszpmf07wcstxnghAyAm89gkc44zbAg8s36pyk7dbfwzndA7pn9fn602kmtct603s86tA89gkxpfszkzpv6q481ppm1b6jmc9Ar6hz90fw2rwjwy6ns3jbmdrl4rbmz4kmphbgcmp23nb1qzdsv3fkq4j0wr2j0xgqjy8tvkky3jjAnrpqfl0x9b81074zzmgnzz12wrh4nk9vd0b9zwz6dwk91ll4hkA57k0zr8d9y1A7cty52tjc8pw2g2jx5zg5hx62y3ld3wv52bpdc4lsdvc6rxzxnbxAdkzxhdf0xqlccj8j7c689dbxs224yh1d3&rd=46857&tk=20e6d28aed912731",
      "impression_tracking_url": "https://events.jora.com/v1/i.gif?d=7j1zqdwxk9lzhd0A2g9886v1lmZg8mwlvj9msgq9sys6mm1fwlvrc1mc56p5A744y9gwjzv3shsdktymy3msrcd78g5kdnz4bj8988vq547ykpxh2xm0h4bjz1g683crdnptA65czppqb4rj6607r4l2mjgkbdhy9z2zh1hsp3hhpdlk5s2A1yv2k2z060xl2lv6csb3r68s3j5pn8vtnk5kt3z7frct2v99m2k60pqs6tw1vy62zkmrl2tc92m3jtl57mnAjpq0qz6tqc4y95Aphsrrmx2n5zhdvz7vrpxvbrls1cydlh9nvvd5gpk5v6l9lmwkjkqrd43w71trgf597qvqw4y5xktpjzncp2qpxvyynmljtqdh1fh97nmdqv1xln1lch7bh8rl2d42gv4285h8cctbhn62vf5k2xq0vw6xkrhdfhy108ylc0qAnxynq5clmp6xp18jd6ps97d5ynkb9mlg6mxz4b9cfc159g276s2khb908A6g9n40dy&rd=47952&tk=27634ffead956227"
    },
    {
      "id": 210192165,
      "name": "ICT Security Specialist",
      "url": "https://au.jora.com/job/ICT-Security-Specialist-0c273fc9dafd746161f6e30ded7823f6?utm_campaign=joraAU&utm_medium=cpc&utm_source=joraAU",
      "campaign_id": 852229,
      "advertiser_id": 12318,
      "category_ids": [6281],
      "subcategory_ids": [6297],
      "request_id": "igvni010yo3akkig",
      "metadata": {
        "id": "0c273fc9dafd746161f6e30ded7823f6",
        "title": "ICT Security Specialist",
        "normalised_titles": "ICT Security Specialist",
        "abstract": "Implement security policies as outlined by the corporate security policies and government policies.\nBuilding SOD policies and implementing identity life cycle management requirements.",
        "text_description": "Manvision Consulting provides IT Contracting and Professional Services to the Australian Market since 2008. Join a talented team and work in a culture that stimulates an inclusive and flexible work environment, offering opportunities to grow and contribute to the company.\nRoles and responsibilities:\nSetup Identity Access Management by integrating the access to the root directory for users.\nSetup Network intrusion detection system, logging system and intrusion prevention system.\nImplement security policies as outlined by the corporate security policies and government policies.\nBuilding SOD policies and implementing identity life cycle management requirements.\nConduct regular audits of the assets being used, logs of usage, incidents tracking \u0026 management and database, application access, and rest of the IT infrastructure.\nPerform vulnerability tests of the firewalls.\nConduct risk assessment for client infrastructure security requirements.\nImplementing and testing security protocols for ongoing projects.\nDesign and implementation of disaster recovery plans from a security perspective.\nFirewall planning, installation, and management of the client data centres.\nDeliver on HLD and LLD of the Network Security Solution for data centres.\nPlan, investigate, set up, and test implementation of VPN, WAN, LAN, and other related devices.\nDesign certification authorities and digital signatures.\nHelp clients in due diligence for WAN Rationalization and DC Transformation\nKey Requirements:\nApplicants must have a minimum of 5 years of work experience in IT security. Must have experience in working, investigating, setup, and testing the implementation of VPN, WAN, LAN, and other related devices. Strong knowledge of Network and Systems Security. Proficient with MAC and OS.\nAbility to communicate clearly verbally and written with cross-functional teams and external stakeholders\nExtensive experience within the application and web security\nExpertise with security tools – static code analysis and vulnerability scanning\nProvide direction and consultation to development teams, providing security services and influencing change to positively impact the security posture of the organization.\nWork autonomously within Security; uplifting secure coding practice, through training and education programs delivered to colleagues working in the delivery of change.\nBuild networks and strong working relationships with colleagues, and been seen as a trusted provider of application security services and advice.",
        "source": "Manvision Consulting",
        "site_name": "Jora",
        "listed_date": null,
        "job_hash": "156889799325552378",
        "raw_location": "Bella Vista NSW",
        "direct_posting": "true"
      },
      "click_tracking_url": "https://events.jora.com/v1/c?d=cwwdmqA1dtfw8np93fqgyvhAl7ZslAw2xj7h04kr05rpbxl1vc5wp4fjct1dnbwA50ppA352l7spsc8AzrxfgmqA29j50ppb3sz28fnz431hyy7lArtc4ttg8h4AAkfmm44g058fzcfrcz8rn6Arcvpvwttdjdhnx1lv567pnmkryzbsc2Ay72gf91xqq7hgA3Ajw112x06q1hAq3fy7fswfcvcbq7p429w7m5l4n1kwyld1dj8pxct8gdxp1qsbA8Akr0s5wxsmk4869bl91fbp123t7zd3h7sbn0b2xc179t55ccp3dcb8dpx7vtlfmtl4kAx15rvq7tg4m5cccvrpzvvxzcA5lw10vsny0lq24tstm1jddgkkz0A5nzrv73Awh23nbvrnf4vq2b63jjsrhmtnd9d0sqmdw791bkt8jl76AA9dljsAtxdprzkjc7vpr7tbjx81s28Abbhh463d5t04tsfx71gtxn22&rd=49152&tk=303e76214861d8ca",
      "impression_tracking_url": "https://events.jora.com/v1/i.gif?d=p3l2fAcyxyqrqv0ndt8ms80c9yZ7vv09gbb9gw99p2xt6dplr7f88fs2mqr0dtkczs930dqA2bfxk6qvdkmm9bq4v5jy697zm3cj3hzA70v988wtcl30gfld7A2wb0z2ss6ghlg17f3lxt791p2m7drd5ptbd6rq2h9xkz3h7t9c8w602f82cqggwz4s2hq48cfAk0h5lpnA9y2vrdjAbw46rl28p3cAbst0b126d659317hb3d2ndw9t0mdv3v0syytbls3xh5vxvc2dxljz2qqx8plAx1hsjbsAj8b7k3bnlAy2scs4hrcjbznprwzr49A8c3txblpx7tmkrsj8d7g3tv7vAmc6w321ln6736gzAgmvxl5qj6fq2n95zkqtkyw9gj209y1nfszndwdkv0358tk5w47x6zd0p8n27zk5vjry4n5rlxsqskjz6fgddlz39q8z1l4sjyh24lAwnd700m0fk26rjw2nk42&rd=50264&tk=0db15bd30f84fb1d"
    },
    {
      "id": 209401702,
      "name": "APS5 Personnel Security Vetting Officer",
      "url": "https://au.jora.com/job/Personnel-Security-Vetting-Officer-6130faeed66282dde523b0a84a38e062?utm_campaign=joraAU&utm_medium=cpc&utm_source=joraAU",
      "campaign_id": 852498,
      "advertiser_id": 121855,
      "category_ids": [1210],
      "subcategory_ids": [1409],
      "request_id": "igvni010yo3akkig",
      "metadata": {
        "id": "6130faeed66282dde523b0a84a38e062",
        "title": "APS5 Personnel Security Vetting Officer",
        "normalised_titles": "Personnel Security Vetting Officer",
        "abstract": "Based in Barton, Canberra you will be working as an APS5 Security Vetting officer to help achieve outcomes for a long-term period, to manage their internal security clearance processes for the baseline, Negative Vetting Level 1, and Negative Vetting 2 level. As a Vetting Officer your responsibilities will include but are not limited to:",
        "text_description": "A Federal Government Department has a key focus on National Security and provides policy and legislation regarding the security of Australia and its residents.\nYour new role\nBased in Barton, Canberra you will be working as an APS5 Security Vetting officer to help achieve outcomes for a long-term period, to manage their internal security clearance processes for the baseline, Negative Vetting Level 1, and Negative Vetting 2 level. As a Vetting Officer your responsibilities will include but are not limited to:\nProcess security clearances in accordance with the Australian Policy Framework.\nProviding high quality sound advice regarding clearance outcomes.\nAssessing and managing complex vetting clearances.\nWorking with short timelines and appropriately manage competing proprieties.\nExhibit great people skills and have competent written and verbal communication skills.\nThe ability to liaise with a range of stakeholders\nWhat you'll need to succeed\nTo be successful in this role you must be an Australian Citizen and have relevant Government Department experience in running vetting process from start to finish. You must also be able to obtain and maintain a Federal Government Security Clearance (NV1 or NV2).\nYou must also possess a Certificate IV in Government (Personnel Security Vetting) and have knowledge of the Australian Government's Policy Framework.\nWhat you'll get in return\nYou will gain unique experience working with an Agency that play a pivotal role in protecting Australia's international interests. In return this assignment will have an initial 12 month assignment with 2 x 12 month assignment extension options for the right candidate.\nWhat you need to do now\nIf you're interested in this role, click 'apply now' to forward an up-to-date copy of your CV, or call us now.\nIf this job isn't quite right for you but you are looking for a new position, please contact us for a confidential discussion on your career.\nSA Licence number : LHS 297508",
        "source": "Hays Recruitment",
        "site_name": "Broadbean ATS ",
        "direct_posting": "false",
        "listed_date": "2022-08-19T07:09:00Z",
        "job_hash": "12825539593776419",
        "raw_location": "Canberra ACT"
      },
      "click_tracking_url": "https://events.jora.com/v1/c?d=ptyxtrn9nrwbdtvgfwqrv1wc93Zgpwlj925kdqccgc6g1jsnx45ms9w6gA1wfvylrtvn87lAAmfv3dzlf30A4w6glqc0cmvlsbh79g2pvlvv4mgyvq19wcy82fgA26lrjy950d8jmthff3tf4wkjf8dAflg31ycnwlAdds6kh5Add7vwzrq5bncy5wlqskrddcq0Aqgm9AsrrnqmAcbA7jbr4sgcq45gx2gnykr32hzvbcm3bsykv5l8zlx07fvp1890p9q6p1rctvy8mpbhjylln5h21bxlbb3j7phqktfy78g076ybw3wn3t74A6Al7wbqspA3yAx4m67488bm3rfbttm7v38pyvb03l8nqv4bycAxAkl84dmmly99sdgptfhmbb578sgkn42qbyqg3bnzAkhyp027dwmlygxy3qx0dzbzm91rxn6AcmrAx3z6wr0my0h1pb986yjv41tc2d8272gydsp1pzm657vttwjdb796lhlrllq2cttbmAwph1&rd=51377&tk=cdadcb5d44caf542",
      "impression_tracking_url": "https://events.jora.com/v1/i.gif?d=1k60ctknlkknyv2zvz0q831w2qZ7fgv20tn288d9y74cz0b52wj7fkwtzcAxq491rdn84q1b99df3vb6q2k86hfvl4yfp6cw0gq4gsl89jgndpsrp9pAlp6l054bbkscsftzt6szfkrs4ntynp9qqyApc29vbzr8ydpb1fpfb4yAbdr9lgsAtpk2y8mjfqfgcvvv11fmb823fy84fAfy84qnrbk8k3l02zqlyk12pt5mxj4lcgjt62cc0qr1vd7hrdlrwkbdknvxzlz1fwx0k5rdd1mgq1vd7bbckzg78f7082dA9h0dg83mjAxml6bdtzf6c9znqm0vg01A530v8djvxl1mmnqgwx5z427kkryg3xtyA9y5d3n7Apqzzljv83y1pjb614nrr2sr2zl8j15zfkfq9v51z2ppsq6bp32m6dhyfv8zy92rhh0b555ctmwymg6j55627st07qlbpl5n0pzcz3md0hwygbslqq28j5pq0zkzAfnk823jgtpv9y&rd=52514&tk=6837c07bee28fb9c"
    },
    {
      "id": 210860642,
      "name": "Senior Technical Security Consultant",
      "url": "https://click.appcast.io/track/f4p8vij?cs=i4q&jg=5rkr&bid=ZTAIU9X3zQHjJYLb9Yqb8A==&utm_campaign=joraAU&utm_medium=cpc&utm_source=joraAU",
      "campaign_id": 852473,
      "advertiser_id": 104422,
      "category_ids": [6281],
      "subcategory_ids": [6297],
      "request_id": "igvni010yo3akkig",
      "metadata": {
        "id": "868392d4d60854676af1415fddcb5e2b",
        "title": "Senior Technical Security Consultant",
        "normalised_titles": "Senior Technical Security Consultant",
        "abstract": "As a Senior Technical Security Consultant, you will join a team of skilled information security professionals in identifying and recommending remediation activities for cyber threats and risks facing our global organization.",
        "text_description": "The safety and wellbeing of our employees and candidates are important to us. In response to COVID-19, we are able to hold interviews and psychometric assessments virtually. Depending on individual circumstances and local conditions, our new starters can also be onboarded remotely.\nAdelaide, Brisbane, Canberra, Melbourne, Sydney\nAs a Senior Technical Security Consultant, you will join a team of skilled information security professionals in identifying and recommending remediation activities for cyber threats and risks facing our global organization.\nYou will be assisting technology and business teams throughout their delivery lifecycles with appropriate, contextualized and pragmatic technical security advisory while managing client expectations, developing relationships, and serving as an ambassador for cyber security.\nKey responsibilities:\npartnering with technical delivery teams to work with technologies (including but not limited to cloud infrastructure (AWS, GCP, Azure),\ncontainer orchestration \u0026 automation tools) and help drive the secure evolution of the organization.\nwork with various stakeholders to assist them in understanding the severity of the security risks and the remediation activities that could follow.\nworking closely with security architects in validating required security controls are appropriately by project teams.\nIdeally you will bring:\na fundamental understanding of third-party risk, security best practices, and secure application development will help to deliver end-to-end project lifecycle support on Agile or Waterfall projects.\nExposure to vulnerability management, security testing and system configuration is desirable.\nFamiliarity and exposure to regulatory requirements, the evolving threat landscape, and industry standard frameworks including but not limited to: NIST, COBIT, and ISO are beneficial.\nindustry recognized qualifications such as CISSP, CISM, CISA, Security+, SANS certification, and cloud platform certifications are highly desirable, but not required.\nTo join our passionate Security team, apply online via the link.\nLearn more by visiting www.macquarie.com/careers\nThe Corporate Operations Group brings together specialist support services in Digital Transformation \u0026 Data, Technology, Market Operations, Human Resources, Business Services, Business Improvement \u0026 Strategy, and the Macquarie Group Foundation. The Corporate Operations Group’s purpose is to power the entrepreneurial enterprise.\nOur commitment to Diversity and Inclusion\nThe diversity of our people is one of our greatest strengths, and in combination with our inclusive environment, it enables us to deliver innovative and sustainable outcomes for our people, clients, shareholders and communities. From day one, you'll be encouraged to be yourself and supported to perform at your best. If our purpose of ‘empowering people to innovate and invest for a better future’ is as inspiring to you as it is to us, please apply. With the right technology, support and resources, our people can work in a range of flexible ways.\nWe are committed to providing a working environment that embraces and values diversity and inclusion. We encourage candidates to speak with a member of our recruitment team if you require adjustments to our recruitment process to support you, and the type of working arrangements that would help you thrive\nA career at Macquarie means you’ll have the opportunity to develop and utilise new skills, explore interesting fields and do challenging work that will impact the lives of people around the world—whether it’s accelerating the green energy transition, helping sustain global food supplies, financing social housing projects or investing in essential infrastructure. At Macquarie, we’re empowering people to innovate and invest for a better future.\nOur size and international presence means your work can take you anywhere—across business groups, disciplines, sectors and borders. With 18,000+ employees and offices in 33 markets around the world, we’re a truly global organisation.\nYou’ll be supported by a diverse team where the unique perspectives, ideas and experiences that all of our people bring are valued. You’ll be empowered to address unmet needs in our communities whilst advising and investing alongside our clients and partners. Working with us, you’ll have the opportunity to make a difference.\nMacquarie is a global financial group providing clients with asset management, retail and business banking, wealth management, leasing and asset financing, market access, commodity trading, renewables development, specialist advisory, capital raising and principal investment.\nJob no: COG-960689\nWork type: Permanent - Full time\nLocation: Adelaide, Brisbane, Canberra, Melbourne, Sydney\nCategory: Technology\nGroup: Corporate Operations Group\nDivision: Technology\nRecruiter: Nathan King\nOpening Date: 19/10/2021",
        "source": "Macquarie Group Limited",
        "site_name": "Jobleads AU",
        "listed_date": null,
        "job_hash": "2584543339015648",
        "raw_location": "Sydney NSW",
        "direct_posting": "false"
      },
      "click_tracking_url": "https://events.jora.com/v1/c?d=04f9hAjnj93ql5k52tA7c9hws1Zqxj7vtv47p9glsqpbm7j1zrkAh67cAldcsj66w4ggyhv9cAAfv6zxhpAtvpqwcl67h87qs0tjz4hfdv7zhh78bq2cwwpw6gmfv8p08c5g6jwbw7Ac2mtcb4y44sgctfckt9synbwtkjvxA18njq6rzl2k1mw8n6jwsnz0bqdjn9k7pj8r72qht8mhvp17wwnx8mjnlkcztdvrxxzmf5ntjb1y6y0g4b43qpgyh935crAb575dks12sckn0Ahdsfhbff4vj4mjjw2vwc5syAngAgr2lhk3bz386kwjcf5ghj8kxjmmsA3s7xtjgkbxx04hxhlhjdjdAzdclzA3A2czg592pkd5t8nAl0A1cvnmhsnbrfpAAnh2x00A163kyt8rmpwq0gm9q57nh9f6m9d2mplAyn81hcm4mh77nj8m45bddpnwlyzb73zc9nllzr8rrfqymxyAb996qnwc630dzw1nlxcrkf8pz81ymq&rd=53607&tk=c1b41ba2cd26a13c",
      "impression_tracking_url": "https://events.jora.com/v1/i.gif?d=ly28z4vv76xtnd9f5zy7hq9h81Zwrjs2Af5ccs900dhs1ypxklvd8r5r85fqn8yvkqb5xd3pA8ks2zvfntA685j2qjg1thggvqf77jwl567k8sb384q9r325hk46pd3bAnb6x5xk53x1ffmz6nsj6lc7fA3twttxc5v0vgvA3tddbv3h9ckcw3jvv45qr9362vycgr7p69dz66hyq1wfw0r5h5bx9qs2bz3hgrts5s0982g5lf0pl8Aw8pnx69b1yygw0rd05m9v8cmkq6cv9bx0rs7qf1smw5hw228hAdkApz13ksph81rbkswcrlvvxjr9lmzzsnltkA6f1hmAkhjxx0pfr591b9q610gl0hwcAlpq9fq7xAhAbhjfr4yxmw3zvnqq0xhpwA8ynmrlm9sgw96mvAhjrs9qvhAksdfh5lhzczjv90rcl9bnz9j1n35cnltcqttw2sck1x4ffdd28xjsd7dhwsxn6n323hr60x4f0dsj2zfn73hw4AdAs3&rd=54724&tk=4f92879816b3407e"
    },
    {
      "id": 209380936,
      "name": "Cyber Security Lead [Sales Director]",
      "url": "https://au.jora.com/job/Sales-Director-feb33fffcfc45df237c0773a53700082?utm_campaign=joraAU&utm_medium=cpc&utm_source=joraAU",
      "campaign_id": 852473,
      "advertiser_id": 104422,
      "category_ids": [6362],
      "subcategory_ids": [6365],
      "request_id": "igvni010yo3akkig",
      "metadata": {
        "id": "feb33fffcfc45df237c0773a53700082",
        "title": "Cyber Security Lead [Sales Director]",
        "normalised_titles": "Sales Director",
        "abstract": "You will be reporting to the SA/WA hub leader to drive the technology risk and cyber pipeline.\nYou will have business development targets to generate opportunities with existing and new clients.",
        "text_description": "Very competitive salary package and full flexibility in terms of work arrangements. Excellent professional development and promotion opportunities.\nAbout the role\nThis is a client-facing and business development role focused on the SA State Government clients.\nYou will be reporting to the SA/WA hub leader to drive the technology risk and cyber pipeline.\nYou will have business development targets to generate opportunities with existing and new clients.\nThe role will focus on relationship building, key communication and building networks\nKey accountabilities\n70 - 80% meaningful engagement with C-suite stakeholders, building long-term and mutually beneficial relationships.\n20 - 30% hands-on project delivery in conjunction with internal capability leads and relevant teams.\nInternal collaboration across the Management Consulting Division\nLimited team and performance management responsibilities (as required as part of BD activities)\nExperience and knowledge\nCredentialed Technology Risk and Cyber lead that is recognised in the market\nPreferred 10+ years of Technology Risk and Cyber and Sector experience with 5 years in a senior role\nExperience in growing business (sales and presales experience is essential)\nExperience working in government agencies and procurement processes\nPreferred big 4 or consultancy experience, cyber sales lead from SI’s like Accenture, IBM, DXC etc. or ideally a business development/sales role within a tech or management consultancy company or cyber vendor like WYWM, CrowdStrike, Cybermerc etc.\nHave or be eligible for NV1 security clearance.\nYou will have:\nExcellent stakeholder engagement and interpersonal skills to build strong relationships with clients and make warm referrals back to relevant capability leads and client partners.\nForward-thinking with ability to take strategic insight, trends and align those to client needs and articulate this back to the client.\nAbility to proactively identify new opportunities with existing and new clients, helping define a view for the client of how we can solve their problem or concern.\nExtensive knowledge and experience in the various facets of sales at full length. Having the ability to identify key needs through client, to identification of key needs, and ability to develop and pursue these through appropriate activities, such as proposals or pitches.\nPresented by\nMouse Croghan | Piper Talent | 0404 380 704 | mouse@pipertalent.com.au | www.pipertalent.com.au",
        "source": "ClearCompany",
        "site_name": "Jobleads AU",
        "direct_posting": "false",
        "listed_date": "2022-08-31T00:14:00Z",
        "job_hash": "12408825181565218248",
        "raw_location": "Adelaide SA"
      },
      "click_tracking_url": "https://events.jora.com/v1/c?d=6pm9rqvtm7t0zcvrs57cg1x3gAZtv1pfpcnl3hrg2rcc27765dy06k423Afql1bffAwr0rl8kg2cfhq7ltgbnwpAp8hAg6bmw104Asqjtvsq9cx0jyg9d8x55rscswcdj5l253nh2fg8x5wh8jjg74fljvtb6v8vA8fq5hbwgbdw1ljrA924h15lt1xAljp0yrjq30h05158Axxnkbwtprhwb48d07k7kg8cmdsy8pqq4sk3qzbd3g8tApcv0yqwhdyAcr38A4hth3lryAfnAmlxflA4qmhxmxw8nf59th6925dsx42l7kx0cb9td5kf21m9Af072y0bn4xb2shhl7gbflqdftgrnl1jckzs3mdh8lf8nmmcdm5ns66qjqt282qjtgywj4hhpv4w9jkz05rfvkdfxlxjyAsykb0mtpglnyx9372rlstp8rf02mz93wx9wwwh09j0zxq&rd=55762&tk=4c5e7a6d02776d6e",
      "impression_tracking_url": "https://events.jora.com/v1/i.gif?d=w57b5mmr6s3vd36mp7g4kqpbnmZ9z80x5zxw2mypl5schvc7rwtl8nz2tmsrm6gh40yxncv86rvj378sjzc5cg9vdcczq5qm23sy5gApdpdvgs16j3g7glbbk1dt6g793nfgsxbl57d6jm3rr5g3hw8g2nf29sbnfvsfbjp0fb0gvfb28dlcjnjkx5kcfbwxxk78nbldv0rzxjAmpqgj5x4jcmmv2w2zw4jn1wcryb3Acg453bldq8vxmdpwAg560gzpzkwyz0AclA15syzr5d16dt3yzmfw5zd1ggjnzhz75k0q1p4v5lmbn6pqynkycdb4yvq3qstz2x1xz8v8kfAqnlkchkxnztfvjggszq5yg1y2kAjsc5p35q267y7hh2pmtz0kv3chhb5kpj29m6A435w9fj6v0ml69xfjm4kphqrtA40r5g5sfp72100x097v5dqqc74734q&rd=56750&tk=a802c47507e7d44d"
    }
  ],
  "request_tracking_url": "https://events.jora.com/v1/r.gif?d=05z0qv26syz292fnlfnl5kn07mZ01gm0vx6As4qg3sql1ynl5mjsnqffg58wzdng95d3vj5g6rhrn7rlyv8zlmhy4z4fp0swqcbgcxnArz7p1gh5hwkvqAgn4sldtmwfg8m6vxj2w3xct2nw6x785dp4fgp58w0btlvAb7pq1jqrzl1AvgA9ybh68kkAbq6jnyfctt19y8bdvs8Ayktnt37qqnnng19d7sl07k3k&rd=57485&tk=60fc67a9d0bfdc01"
}
