{
  "ads": [
    {
      "id": 210581932,
      "name": "Lead Consultant, Cyber Threat Intelligence",
      "url": "https://click.appcast.io/track/f3qgg9h?cs=i4q&jg=5rkr&bid=ZTAIU9X3zQHjJYLb9Yqb8A==&utm_campaign=joraAU&utm_medium=cpc&utm_source=joraAU",
      "campaign_id": 852473,
      "advertiser_id": 104422,
      "category_ids": [6281],
      "subcategory_ids": [6297],
      "request_id": "ocdlcqntig1lfjco",
      "metadata": {
        "id": "a82f2f8df702eeec15c875f8e6a67de8",
        "title": "Lead Consultant, Cyber Threat Intelligence",
        "normalised_titles": "Lead Consultant",
        "abstract": "As a Lead Consultant, Cyber Threat and Vulnerability Intelligence at NAB, you will investigate trending global cyber events, emerging dark web threats, threats directly targeting the bank and use your own research skills to find pieces of information, connect the dots and identify and attribute threat actor’s motivations, tools, tactics, techniques (TTPs), and procedures.",
        "text_description": "Research, track, and profile the latest cyber threats targeting Australia and the financial industry.\nProduce world-class threat intelligence and collaborate with law enforcement, industry, and government to reduce the impact of cyber threats\nLead, learn, build, and innovate as part of a tight knit unit in one of Australia’s most advanced Cyber Threat Intelligence teams.\nIt’s more than a career at NAB. It’s about more opportunity, more moments to make a difference and more focus on you.\nYou make NAB. You get it done for our customers and our communities. You’re laying the foundations for NAB’s future success. Together we’ll grow, excel for our customers, and make this a workplace to be proud of.\nIt’s a good time to see what more you can find at NAB as a LeadConsultant, Cyber Threat Intelligence.\nThe role:\nAs a Lead Consultant, Cyber Threat and Vulnerability Intelligence at NAB, you will investigate trending global cyber events, emerging dark web threats, threats directly targeting the bank and use your own research skills to find pieces of information, connect the dots and identify and attribute threat actor’s motivations, tools, tactics, techniques (TTPs), and procedures.\nYou will apply your understanding of the cyber threat landscape for stakeholders to replicate and mitigate threats, prioritise detection and response, and ensure the bank is focusing on the right initiatives to protect NAB Group, by producing various strategic, operational, and tactical intelligence outputs. This will also include responding to stakeholders’ Request for Information (RFIs) and creating intelligence reports, which will require an independent, thorough, and diverse individual, capable of creating accurate, relevant, and complete intelligence outputs to the highest industry standards.\nYou will also utilise your knowledge of Threat Intelligence Platforms and industry taxonomies to engineer the collection, processing, and dissemination of threat intelligence to controls, attack simulation solutions and vulnerability management. This role will require leadership skills to mentor and guide other analysts in various cyber security tradecraft, and be able to run operational meetings, and support incident response teams in the event of an incident.\nYour opportunity:\nUnderstand and research threats targeting or may impact NAB Group and our customers and produce trustworthy, actionable, and timely intelligence products\nCreate world-class threat intelligence collaborate with law enforcement, industry, and government to reduce the impact of cyber threats targeting NAB Group, Australia, and the Global Financial Industry\nPioneer NAB’s threat and data led strategy to influence the strategic, operational, and tactical decisions to protect the NAB Group from Cyber Threats\nUtilise Threat Intelligence Platforms and SIEMs, to create a library of threats directly relevant to the group\nThe role and Day to day will include:\nDaily threat calls and regular threat briefings to advise stakeholders of the most recent threats, how they work and why they are important to NAB Group\nApplication of Diamond Model Intrusion and Mitre Attack in the assessment cyber threats across strategic, operational, and technical domains\nAnalyse ongoing attacks as phishing, DDoS, data leakage, ransomware and more, to assess their origin, purpose, and impact to NAB Group\nDocument, prioritise and operationalise the collection, process, analysis, production, and dissemination of threat intelligence based on stakeholder requirements.\nRespond to customers' RFIs and investigate them according to the time and scope defined, while using every tool and technique at your disposal to uncover new information\nWhat you will bring:\n5-8 years of experience in mid-senior roles in incident response, malware analysis, detection engineering, intrusion analyst or digital forensics in the cyber security industry\n1-2 years in cyber threat Intelligence\nA passionate yet humble professional with experience in communicating threats to both technical and non-technical stakeholders and follow through to achieve outcomes.\nExperience in investigating threats, utilizing OSINT, closed sources, and other research techniques to uncover threat actors and their TTPs while providing context to threats and reaching conclusions from incomplete or missing data.\nTechnical know-how on extracting threat data (IP's, domains, ports, malware, and malicious communications) from multiple sources.\nBusiness understanding and familiarly with corporate security solutions.\nExperience in leading and mentoring small groups\nA diverse and inclusive workplace works better for everyone.\nAt NAB, we’re intent on building a culture we can all be proud of. One based on trust and respect. An uplifting environment where every single one of us feels appreciated and empowered to be our true, authentic selves. A diverse and inclusive workplace where our differences are celebrated, and our contributions are valued. It’s a huge part of what makes NAB such a special place to be.\nMore focus on you\nWe are committed to delivering a positive experience for our colleagues and a workplace you can be proud of. We support our colleagues to balance their careers and personal life through flexible working arrangements such as hybrid working and job sharing and competitive financial and lifestyle benefits. We invest in our colleagues through world class development programs (Distinctive Leadership and Career Qualified in Banking), and empower you to learn, grow and pursue exciting career opportunities.\nJoin NAB\nIf you think this role is the right fit for you, we invite you to apply. If you require any reasonable adjustments to the recruitment process or the role, please let the recruitment consultant know.\nPlease note candidate screening and interviews may be conducted prior to the closing date of the job advert.\nPlease note unsolicited CVs from agencies will not be accepted.\nAdvertised: 29 Aug 2022 8:15 PM AUS Eastern Standard Time\nClosing: 12 Sep 2022 11:55 PM AUS Eastern Standard Time\nApply now Refer a friend Back to search results\nPowered by PageUp",
        "source": "National Australia Bank",
        "site_name": "Jobleads AU",
        "listed_date": null,
        "job_hash": "580763503750261920",
        "raw_location": "Melbourne VIC",
        "direct_posting": "false"
      },
      "click_tracking_url": "https://events.jora.com/v1/c?d=gdAb09lltnlx6w6lzx9mmp5p82Zrw0bqd5zvxt7g4xgqv4mj71lkkvbwssgmArpvgn0g9lkdl2bvs1s1nnj1j8lbdf6j89gzcf4xg3q21j7mvrhg6jzzywnylgn5896w6g51zpnkkt1qsyg504cptsp2dA6lb1pzmgjm09yxjt0mdkb18f1rcx0sgnrgbpy5wnsbwvgjAlj79h5z715lbwm5Aq9jkv3n7j4wwkx2tq5d0xv8s8qrlvchgggxxphqhcp5j7fmA23hgy35cckj4rgdz8vndndr9wkpb6v2v3v1lnpvypnwz0j1d2qyl9tAv6qndwhcc0kpw3f7hApp4ky5hm5zpvtApn63A1g98kmp9djy973ytnsyA2Am0kr3l16yk5p4ph8nxbvgcjjqst84jhsrqqy95c4jpdfp0vnqdbwklx1ll4jAy8z7g8dy127fxqfsjk11m0dnv1qxwx084qydb2b3xytt5n8vrvxy76kp6yvb9gn9yh34lwklxq&rd=362720&tk=f194d845d183cac5",
      "impression_tracking_url": "https://events.jora.com/v1/i.gif?d=5mtmrbv8906sr4km8t3970vwg1Z7vbm5vrhxzpzlmpkjgdxl7r075m8t2xpgndp6s7jm3xyj0mg837s1flgxlxwpvtqkyjz5q7gq0x5dbj69glj1tn86vjfb5sc3A1kz521tt082rhzrgh5yl4rgmlwmrdn2bxnj5qfkwcv45sm4gv3pj03dvlld096ncy3hnyk079s8wAtcql4s93lgjwtm60qb45yvbhzykk2l01nkfvt3zjzyy6fg63xmg18n7s8qgcd2b9c626tm5kc0Azlnwldnwpqqngzlwb5A3d93wlb9fr6qd0twsgg7bnmyk46xg4vc0p8757wzgp4hsb3nwwbhdfAvnfh98cv01kln0k2cdyvnhqkt007zpf635cxqfw6t2n692f0g6rAdc4g2AsjsAlw6Arjzx1hzxt3wvrpkwAqjw4rc499lf6z68gtgpmr7qww0wnA2gsqndvbv5bkAffdkhA04r681xb7wmnlxdl0g0c4Aygc7n33Ap1&rd=363793&tk=c4f533c630c4eca1"
    },
    {
      "id": 210669372,
      "name": "Staffing Senior Specialist",
      "url": "https://jsv3.recruitics.com/redirect?rx_cid=3493&rx_jobId=18298BR&rx_url=https%3A%2F%2Fcareers.bcg.com%2Fjob%2FBCG1US18298BREXTERNALENUS%2FStaffing-Senior-Specialist%3Fpaid%3Djobboards_phenomfeeds%26rx_campaign%3Dreach48%26rx_group%3D130389%26rx_job%3D18298BR%26rx_medium%3Dcpc%26rx_r%3Dcpa%26rx_source%3Dreach-jora%26rx_ts%3D20220913T045408Z%26utm_campaign%3Drecruitics_peoplehr%26utm_medium%3Dpaid%26utm_source%3Djobboard_phenomfeeds&utm_campaign=joraAU&utm_medium=cpc&utm_source=joraAU",
      "campaign_id": 852527,
      "advertiser_id": 84767,
      "category_ids": [6317],
      "subcategory_ids": [6318],
      "request_id": "ocdlcqntig1lfjco",
      "metadata": {
        "id": "bee45f0f109982dfdd671051e309fea0",
        "title": "Staffing Senior Specialist",
        "normalised_titles": "Staffing Senior Specialist",
        "abstract": "The Staffing Senior Specialist (Functional Practices) is an integral member of our Australia \u0026 New Zealand (ANZ) Staffing team and supports the staffing of all those affiliated with our rapidly growing functional practices. In particular, the role will support staffing of those within our Technology \u0026 Digital Advantage (TDA) practice area (including generalists, IT architects, cyber specialists), our Climate \u0026 Sustainability practice area (including generalists and experts) and, other high priority functional practices as they continue to grow such as Risk \u0026 Compliance and Operations.",
        "text_description": "The Staffing Senior Specialist (Functional Practices) is an integral member of our Australia \u0026 New Zealand (ANZ) Staffing team and supports the staffing of all those affiliated with our rapidly growing functional practices. In particular, the role will support staffing of those within our Technology \u0026 Digital Advantage (TDA) practice area (including generalists, IT architects, cyber specialists), our Climate \u0026 Sustainability practice area (including generalists and experts) and, other high priority functional practices as they continue to grow such as Risk \u0026 Compliance and Operations.\nThis role maintains a primary focus on staffing resources within the ANZ geography, however, will also have strong connections into the Asia Pacific Staffing teams for Technology \u0026 Digital Advantage, and Climate \u0026 Sustainability, and will help navigate broader opportunities across Asia Pacific within an individuals’ functional practice where appropriate.\nThe key focus of the role is managing day to day staffing needs, involving regular engagement with the relevant Managing Directors \u0026 Partners (MDPs) and functional leads; as well as with the individuals being staffed to understand their skills, experience, development needs and preferences. Overall, this role will take a lead role in shaping the success of the relevant practice area in ANZ, as well as regionally.\nYOU'RE GOOD AT\nThe key focus of the role involves:\n* Proactively identifying roles for functional consultants based on capability, cohort, and availability\n* Propose staffing to functional leadership based on case requirements, capability, and availability\n* Supporting the leaders of the business to understand and make trade off decisions where required\n* Meet regularly with consultants to understand capabilities and experience as well as preferences; seek to ensure staffing deployments address career development needs wherever possible\n* Communicate staffing decisions to consulting staff\n* Maintain up to date and accurate staffing records in the staffing system\n* Actively participate in relevant Career Development meetings for functional consulting staff to provide staffing perspective on relevant consultants and better understand their individual development needs and strengths\n* Work closely with the finance team to ensure synergy with case commercials resulting in overall profitability\n* Actively work towards improving process and efficiency by supporting the introduction and rollout of new policies, guidelines, and processes\nIn addition, the role includes:\n* In conjunction with staffing and broader leadership, help raise MDP awareness and understanding of functional propositions and how to tap into those opportunities\n* Work with industry nodes, in alignment with Functional leadership, to support the emerging agendas on priority topics\n* Work with finance team and stakeholders to manage lead to close of case/assignment process.\n* Provide input and insight on business momentum to inform staffing and investment decisions across the business\n* Building relationships with the ability to generate respect and trust from others, exercising good judgement, professionalism, strong interpersonal skills, and a collaborative working style\n* Demonstrating strong written and verbal communication. You’re able to effectively tailor and personalise your communications to work across all levels of our organization\n* Beyond being able to deliver on ideas and manage stakeholders, balance will be crucial. You will need to listen, negotiate, and flex where needed; while also having the stamina and strength to stand your ground on what can be reasonably accomplished\n* Understanding the big picture and getting clear on which activities will make the biggest impact in realizing our commercial priorities. This requires the ability to bridge between pressing needs in our go-to-market strategy and the preferences of individual stakeholders\n* Organizational skills – an ability to handle multiple tasks, prioritize them, and carry them out independently. The role will require you to work proactively to achieve success\nYOU BRING (EXPERIENCE \u0026 QUALIFICATIONS)\n* Demonstrated subject matter expertise in technology in a top-tier consulting firm\n* Genuine interest in talent development, and a focus on learning and development\n* Experience proactively taking initiative, using good judgment to prioritize requests, and working with minimal direction\n* Strong commercial acumen\n* A bachelor’s degree, and preferably advanced studies\nYOU'LL WORK WITH\nBCG’s HR team works to attract, develop, excite, deploy, and retain the best people in the market. Those in human resources jobs manage the life cycle of all BCG employees—from hiring top talent and developing their skills to rewarding their contributions and supporting career progression and mobility.",
        "source": "Boston Consulting Group",
        "site_name": "Recruitics  ",
        "listed_date": null,
        "job_hash": "593842953647344016",
        "raw_location": "Melbourne VIC",
        "direct_posting": "false"
      },
      "click_tracking_url": "https://events.jora.com/v1/c?d=tA4hrxrxj2n0yrnvrd5kq7yhsqZA153p6xA7mz97bdqnhvj1w4xwd736mn5szA35lf1spAv7wx7cvqqyy16sz2sw27l8vryj1zzrmhyllykh6qlq6ltxwpc6ph6ft72zycd9tjzy4qdsfz7mhpbw62pw23j8tk2ygtsf04jbk0fx4ngvfgprlbftwrt1l11f898vx70yg7dgplfmb87hyw6m3lj2n9hb8wcc8v24srbx6jgmzqvnl6hAf2cmv2z2rgt8l30z7Asgpz5v9lq8yrcArqx7bp21b61s962d89hrss7A4s40m5qyxql1cddnqdt20p79y6xmh4rA2wdndjh6zwww7d48qbm68frlAzf2k7A56pd9vv00A9rmqrnz776vf86gq19kb59fdywz75w5ygd20x19cz6l8xsA4Ajgfpfd4nt5jpn57tqt4rsyxdhvy1l2gpcq1w4kykh87plqdrkq7bzg8k0vlzsys49nAhmt9km2q679k9yyhnp3wbqtcyx092t7hl8dcw62g55n0b6fymAAdg60q3j8bt6Asncc4t338858x9d3gbqlkgkn36zcfgh8jppqm52bztgnsgps2wmktfplj2w1Alsz8ws4lpzzhgAArnhl67ptnn3vv9rcdg5773lwrtrbg2312xc99kwAz0kq28wg2t4sql52hh60g7gssf0n1h9v3s352947qbk9cztx0zq60hp19cthnc14z41g5n5qz6g533ft479rzgAqkv3fzApn4wmvl3hj8mxfyjt5w4df5tv6ycdjnApz7w58byj9vwhAr73zfn1r2j7s2732fbqAr41vb90jbj6qfk36twxw291p9jAc8yjgsjAm7dtd1Ayt92c8rhwt8yzAtwr4gbxn8zvfl30njpk6mhztqgqg26p475fw11ss0xv4rms1bn1s2bgdwkm44rhycqjmyzynpjqfwlqwcqA7z9dlskmnzy52g2lndjnf0qfbm0ygy6w5dtdgxAjgx3ck6s2h328dk97y6qg1m4hdmvjjpw7z27r3jvnAkw3182gch8s0zzAz1lhycxAyrzdhw8xpmdqAg1h4rdmryjrf87fs2pw57066r4gy3kAhcdg9tbv1Alt8htbx9blfrxd2lld3j0s8py&rd=365700&tk=e1d7af197f382ee2",
      "impression_tracking_url": "https://events.jora.com/v1/i.gif?d=Apqb5v1nb7thwsjxww070wlkdqZp625xr91rmdkzA8rfdhz5904k3mq5gn5c74sslxqgdlvwjqw6qtcA40h8gp31912cfzm6sk367dnp1ddy19p9t4q5cfbr2k71h4dvs9bdfb5t8nv5dj19fgytth97xq7tlccbl9p0x44f75bdA3d7xnhy7dqqddtfctwv6c5w4djtdckvb3w6xq40phj182Arkwl4gr3gkbt5m1pxyj2k7d341tjjwn4fnsrAj6h1856wnnx4hbb4bq1q0jgssdw6yjx7Ak3wx4Alfplxwf06ydfqv09v0yvA51c8k155k34lnvh1wz98t13m7gwh9gy5pywfzr7p17d68g8tb9xlbsxtyccv9w1q2l3gjyz474jspmpjAh3s281g5n84fv3r9jxddjtbkjrqp5brjnym1b86btlbjw5w8vjty4r1ylj7pd6zbck0fjmlq3xlgAw286nxytjw55sytj6zn64hdrk10b4vhhxp6d183v9d7Ah0xw6m7y5qvbtj6frzq2y5xfgys3nl8f2xyl5gA8Am6ql0bzqly1fzks76dvz65vwyv3xsx1hAyjpd3tAh3yz11sx0zm8247gs3jg62ngtqmn42jwl91ff40g7cyy5b7bA2gjv7vmf0nj5qfg2g3vxdq2Ajr13glAvqn6t0g0frqlmbv1t4m1clzdxnlx5k2fsk44h7nvsf6b7bhwnylgvzsmrAc3jxhcxwpqrhmvx31wqwlrq5lcmxAgAxsmcdAvdfpvhkk19gAv3Aqxp68mtqhvyw98ymz3qt1rq473n1b6td2dh3yAm06rhczrdqpr4qyb8hy143cq3ck62289rt0c5rdhygsry05mfz6bncv9d09pbhqt910mlq91q7y7kv0mqyg6Aj5ypylA9qq7rh98lx7d5jk77fg8wtls7mAc6rvxmr2gzqwbyrmqdrwgj4jdxhkp1xs4jk42nggmhwjzkxvfb3xm0Av11rt24bfcqxpAzg3zf6wj3zxxgc5wh4A2mshvj0t32phyctAA4nsb79f9s22vmhsgq0vn8hp6xzt12y2Al9vk1qjxhgAvdc12rp6cg4tq7lzm3tnmrr1Aynfc1rrnrvrtdv6tmbp5w76x83msr2lt7z1&rd=367274&tk=9bd491f065343574"
    },
    {
      "id": 208329725,
      "name": "ICT Security Specialist",
      "url": "https://au.jora.com/job/ICT-Security-Specialist-f3562b75583a5a56c36c3d2142e01136?utm_campaign=joraAU&utm_medium=cpc&utm_source=joraAU",
      "campaign_id": 852229,
      "advertiser_id": 12318,
      "category_ids": [6281],
      "subcategory_ids": [6297],
      "request_id": "ocdlcqntig1lfjco",
      "metadata": {
        "id": "f3562b75583a5a56c36c3d2142e01136",
        "title": "ICT Security Specialist",
        "normalised_titles": "ICT Security Specialist",
        "abstract": "You will have well developed skills in ICT Security to help develop our organisations security posture; work with our project, service and engineering teams to design, implement, service and maintain hardware and software security systems; and prepare and maintain documentation, policies and procedures for our organisation and clients.",
        "text_description": "HSC Security specialises in the installation, integration, and maintenance of security surveillance, intruder alarms, integrated access control, and intercom systems. Our extensive experience in the corporate and commercial sector makes us one of the strongest operators in the industry.\nOur team is committed to delivering both benchmark levels of customer service and business performance that has underpinned our growth for more than 10 years. At HSC Security our people are our most valuable asset and we seek exceptional people who are both passionate and committed to providing quality work for our customers.\nYou will have well developed skills in ICT Security to help develop our organisations security posture; work with our project, service and engineering teams to design, implement, service and maintain hardware and software security systems; and prepare and maintain documentation, policies and procedures for our organisation and clients.\nRole and responsibilities\nManage and administer organization’s ICT security policy \u0026 procedures to ensure preventive \u0026 recovery strategies are in place to minimize the risk of internal and external security threats.\nWrite and plan IT security policy and procedure including IT security control, IT security education, IT security data recovery and IT risk management\nConduct system audits, performance analysis, system firmware/software upgrades and preventive maintenance as required.\nAccepting responsibility for the processes, procedures and operational management associated with system security and disaster recovery planning.\nLiaising with security vendors, suppliers, service providers and external resources; analysing, recommending, installing and maintaining software security applications; and monitoring contractual obligations, performance delivery and service level agreements.\nInstall, configure, and administration of servers, configure security controls for identity \u0026 data protection, and access control systems.\nDesign network structure and configure layer 2 and 3 router, switch and SSID planning\nDesign and implement network redundancy to maintain system availability, resilience and redundancy to ensure desired uptime.\nPreparing and maintaining documentation, policies and instructions, and recording and detailing operational procedures and system logs.\nInternal and external vulnerability prevention and protection with daily trouble shooting on hardware and software, e.g. End point firewall installation on staff devices, and upgrade applications\nSkill and requirements\nRelevant Bachelor or Master qualification and 3 years of direct relevant experience\nEnthusiastic, driven security professional\nEnjoys being informed on trends and issues in the security industry, including current and emerging technologies\nStrong verifiable IT-related security skillset\nCommunicates well and works well within and across teams\nCCTV System experience\nCurrent NSW 2C Security Licence (or ability to obtain one for applicants from overseas\nValid Australian Driver's Licence (equivalent to Australian DL for overseas applicants)\nSalary- $90,000 - $110,000\nHSC Security Pty Ltd Master Licence -\nNSW - 409166524\nACT - 17502489",
        "source": "HSC SECURITY PTY LTD",
        "site_name": "Jora",
        "listed_date": null,
        "job_hash": "665811704559188926",
        "raw_location": "Condell Park NSW",
        "direct_posting": "true"
      },
      "click_tracking_url": "https://events.jora.com/v1/c?d=c391lvx5tg3clz7cctkpwhyl5yZgb213zzbf4q1nd5Ah9zsAct11xw9b7gwlA20fxmsqAsgy167thd0whn1pd06bq3x439gjs75cj6gdkr8n0vk0kq7hx495334q3bpt7cfrynjgd5qr003j000qk4ds22dgrh4sj8n9bx89qgxgb2jkyb0fmccj4p5pw291wbppfbm0k0669hhl13d3cqf995nzc6b342p1f2m4j8x8A7c07yzqwyhxtmgm1rd67hfjqt9j6fm0l518mt9njzxdbzcz9b33ypm0q0A9bzrln72wx9z4yfy0pb2ktd27f10Akyj0b966w59pA7b5fA8wh4lztqk7h2jdr76lxkd56kfdc05tdy62ppq0b8cks3kb2vAp33q4fAvytlxAcg4053yz818c2zpgvcpwrnj866k0zyc8dd2vkbwmt1dsf4d51p53l10kpAfnvlhr6whmnllg78yymA3y0zxm&rd=368383&tk=c7b828ee3b5720fd",
      "impression_tracking_url": "https://events.jora.com/v1/i.gif?d=cAthl8v1qfckc9ggzyvktl8shAZbv88wv95qAf0z3q3b83qfq2xv014zq4cfh9b289hts34yw9mv91A00wrfhAblfqlfxtyzjqdq0AnlfyAbj9xjfdp2g09dvkgmvqqr89vyd6cy0lgqk0bx1rzrv1pw9dnpt4s62qm3vw57x84p9ph6c6sxrd8hr26vkstvA17xtpf2A0c8js3zhywrlmjsjvnAcb8hyhzyghjqrwfwxphxy2hmwcfnv8c8jrsA0ctl6zjczpvbq412kxl4yj8mb3d4sg81lx2h96wj8lgfxptz9n771gyl0p7A4p540w84cgb4c2027pq0nxnnsw7ptgmp2j049mA3h2t2v0bqnv0v8l8ntzAx2nj4z3kzbncpAvqqkzk5y9pthlA21kzr813jwbvgrjncyjnlcxb79vlll7tr9nqwA4pk228qAgx37cq2swp1gclngqAhmc5brswjmhgb8yf1ngA9&rd=369494&tk=1e1b2af435f3a476"
    },
    {
      "id": 209212547,
      "name": "Information Security Officer",
      "url": "https://click.appcast.io/track/eym4t4m?cs=lgq&jg=50oe&bid=RjisTn_QvJ_s6s7uxZBkFw==&utm_campaign=joraAU&utm_medium=cpc&utm_source=joraAU",
      "campaign_id": 852494,
      "advertiser_id": 131052,
      "category_ids": [6281],
      "subcategory_ids": [6297],
      "request_id": "ocdlcqntig1lfjco",
      "metadata": {
        "id": "a6895932f831930f0b4ff42dae0f5493",
        "title": "Information Security Officer",
        "normalised_titles": "Information Security Officer",
        "abstract": "If you're interested in this role, click 'apply now' to forward an up-to-date copy of your CV/ email me on ajit.kumar@hays.com.au, or call us now. If this job isn't quite right for you but you are looking for a new position, please contact us for a confidential discussion on your career.",
        "text_description": "Work with an Information Technology and Communications Support and Solutions Business company which delivers IT Solutions.\nYour new role\nAs an Information Security Officer, you will be:\nConduct Risk Assessments and Audits\nDesign, develop and analyse internal standards and policies\nWork with security frameworks such as Essential 8, ISO 27001\nPlan and implement auditing, vulnerability assessment, pen tests\nWhat you'll need to succeed\nSubstantial experience in similar cyber security role, preferably professional services\nExperience with ISO27001, Essential 8, ISM, SANS and other control frameworks\nExpertise in Firewalls, IDS/IPS, SIEM, DLP, vulnerability management, mobile device security\nSecurity certifications like CompTIA Security+\nWhat you'll get in return\nAttractive salary package\nCareer progression\nFlexible working arrangements\nWhat you need to do now\nIf you're interested in this role, click 'apply now' to forward an up-to-date copy of your CV/ email me on ajit.kumar@hays.com.au, or call us now. If this job isn't quite right for you but you are looking for a new position, please contact us for a confidential discussion on your career.\nLHS 297508 #2691982",
        "source": "Hays",
        "site_name": "E-Financial Careers Australia",
        "listed_date": null,
        "job_hash": "10467924687499193",
        "raw_location": "Melbourne VIC",
        "direct_posting": "false"
      },
      "click_tracking_url": "https://events.jora.com/v1/c?d=m3ltz76l4jy3p9nvtmgdyqtxtmZft968mz4v8s23ltngwnd6ky3w6lxwA23fA886szqhfzqjqp6bq2h1mvrckfwd4Amyyq8cvv9355A3r3j12gpvrd00dqcl36gtj3jf5gAnyv29AAcfxkx8x2g3gtvm9g15lh5Adt7zAw60c5gx12tz94j5b5hdqj2mtdf9fhnzkx055mt2Alyxq25wbrchtnp9f2162w99qf0vwty37m1wwbsk955d1r4p6A3mntwr1d8bAr6vn0mz9vsnyrAhtw64j7bdb8wd9r5fpfymdhfm7cwctt85f2cvt8m0cw4s43k89bh3hy04575g9nlvw6Avwm03t3n3sjpywAqgn1klnps27fr2zvbgwv4fdz16mg3z0lhlpb2prcnpr6xb480Awwn37sdc678tsmqm1yzAdyxj4dg2bybvz10jjdhc5k5rvf6594q6vzhs10vnd7t2rAp2qx51tvyqkAv0k2vpsr039d9tr3f6nsx3v1&rd=370603&tk=258687681afb7865",
      "impression_tracking_url": "https://events.jora.com/v1/i.gif?d=yqw2ht9f8Awbmbx92vxpl9llrAZfp7pzzwfgtkjh76fjgArq6p2bAmgpmppyr2bc7ttxxhs6h9jjx3s3jmzj5A2Alxnpgwhly45vc90k82cvhb08t2t649c82n746pg4b09hAhwm1hgrlAdk3zcfqp91ggw6f8fs3bjgnzdAc6pyA83qzk05cx0l7z6y9g7ypwA7r7wx4sp875hAybp9g5mbmcg5f6q0vs0608jp754m8vq3lwpkl4jp5t90hhjh1mfkmAzy3qtvcgfy7vbz6hm8133x4mw10Ar2j9rcrzw0clcl6rmfkkmg7b5827539w52blq89hzrt4gxmkdpbh6x4n6h4Avgyw4xq1stgpwczAfxA40Acx4wjchm0rn8x94A3g6p34t2m8ns2bh854zxyh23b06tcs1w48z48fnp36cfdbthmA0ksp3pxgtxpgf8yk3pls84rl78hbsptw9l26A860kqm55pytkwkqsjtgfl00dtAxn0ww62Akz0r1&rd=371702&tk=7fcb04482ffab7f3"
    },
    {
      "id": 210890196,
      "name": "Ping Identity Developer",
      "url": "https://click.appcast.io/track/f4uly7p?cs=lgq&jg=50oe&bid=RjisTn_QvJ_s6s7uxZBkFw==&utm_campaign=joraAU&utm_medium=cpc&utm_source=joraAU",
      "campaign_id": 852494,
      "advertiser_id": 131052,
      "category_ids": [6281],
      "subcategory_ids": [6297],
      "request_id": "ocdlcqntig1lfjco",
      "metadata": {
        "id": "9015e327e830ee55f07c7ac8fe22392b",
        "title": "Ping Identity Developer",
        "normalised_titles": "Ping Identity Developer",
        "abstract": "My client is a giant MNC IT consulting and service provider organisation requires a Sailpoint/Ping identity developer. This is a hands-on role and your passion for technology and IAM would provide you new opportunity to learn high tech technology within cyber security.",
        "text_description": "This role sits within a service-based organisation with a head office located in North Sydney and Melbourne. You will work with one of the leading clients in banking sector with an excellent reputation in a highly productive team.\nYour new role\nMy client is a giant MNC IT consulting and service provider organisation requires a Sailpoint/Ping identity developer. This is a hands-on role and your passion for technology and IAM would provide you new opportunity to learn high tech technology within cyber security.\nWhat you'll need to succeed\nStrong understanding of Sailpoint/Ping identity or other access management concepts.\nGood understanding of Ping identity preferable\nGood understanding of onboarding application\nHands on experience on configuring data store\nKnowledge on Rest APIs, XML/JSON\nWhat you'll get in return\nYou will be rewarded with fulltime permanent role in one of the leading service provider organisations with a very competitive remuneration package. This role will offer flexible options with WFH and great career growth.\nWhat you need to do now\nIf you're interested in this role, click 'apply now' to forward an up-to-date copy of your CV, or call us now.\nIf this job isn't quite right for you but you are looking for a new position, please contact us for a confidential discussion on your career.\nLHS 297508 #2694550",
        "source": "Hays",
        "site_name": "E-Financial Careers Australia",
        "listed_date": null,
        "job_hash": "1463510350079422",
        "raw_location": "Sydney NSW",
        "direct_posting": "false"
      },
      "click_tracking_url": "https://events.jora.com/v1/c?d=bg46w7nthqgp77ftv9m1nAbph2Zthm56mtrtjxgfygAhy8wmqtz6jsjnzsjyvlhbkczvsr4yzA3nfyfj3b870x5rmr27bxrvdfvtqr7kbwlmd09tjbf1glb2s663vjq4mhw1m8b2ppAmtlx69l8p3h9gm4hrh3088tk3szy68hfb19v3csszhmm7d3ybc11zrb2nyztllpfvAydkjmqkzqr7cbl38hjwgk57jgw8hzgpgtgfv6st8j1tgh65d8q3fx440jmcAxbxjxym45dpzjf0mmdm38cmt36Akhmjjtf6gjA48d6xglfwlkvvyq2vl97cjqb8vv19v3zb9lbpw3rcfA6Ac1mp55hf6ky530t0ff42qv784k2sfc5qjfx6wr8qmskl70gwmAxll838hl6pwd5rqAAffAk143pvsn87hk2bqp5y213kbm4yldk1vmttv2g12ygsg7jnAwl8qlhyjn7ns5Avb83z6s9zbvsqlqw47ydgz62972d355rmvq&rd=372799&tk=d1274a06202382ef",
      "impression_tracking_url": "https://events.jora.com/v1/i.gif?d=fx7zvzmwjk93fksAq87gn89hfmZ625mg5vbpA14fdd82f4vdhsj71hrzzyw6bw5sbm3mzwsjm4z4l67c2sds1pwdnvlf8p6lsw0229mxtcs3b411jrnl0kb2wyk2Agx33w0kcg5t11q702n9hzhpc3xdwA5c25j59px0bw91lq10rg6xdrAs183rndgp5p1fmzcd32rmvcmh7cv5bf221m0f09d95x1r1xsp3sA0jqdjdb385cky7b6jggkmbg222bn6l4qyk6vvs4xrf8ckxws99twjlp1fA03qrg7f00g7qcAqlj7dwfh5xgsc8Ah65l99hzwhxvw94wfy0ftwtj7b2glAsb1yls5gr3bhwqx1kymmAsq9sfcAmq2h90r74ycnwsf3p1zms076k00dtr2ymdtvl1k16q71b4A5ycydhd8s5ydxhfbn292dqf65tc62r755x2t5q9l3fdqtd8Ashp33f5wsp2386l5pp7pq93xqqh9v6d38n2w5vqnq13&rd=373938&tk=7bd280dd495cc8a1"
    }
  ],
  "request_tracking_url": "https://events.jora.com/v1/r.gif?d=kyrx98A1l815t9x88qzqjy2fzAZbyhA1wmtb5v2kc0skc1zA8sh2A0v5hgqjfcv2AAAzzhzjs3m3kxA8hm66l3j0fl39b3A1mn3r8mz90yt1p146ndq5zw4nddc4zs2wshry8cdmgyyf1nmxrxbA2lzs21vAjc3q5k9gs1A4hyyy39xzxk72953n90z7kc53hfjc2v69s9p8d08f34v0vhhbgbb2xApfqqmsscb9&rd=374724&tk=abfc01e7b6b7cc6c"
}
